

$(function(){
    iniDataTable();

});


//表格数据
function iniDataTable(){
    $('#memberBalance').dataTable( {
        ordering: true,
        sort:false,
        processing:true,
        searching:false,
        autoWidth:true,
        lengthChange:false,
        data: [["闽A835CB","包月(包时)","包月套餐有效期：2017-7-01 00:00:01-2017-12-31 23:59:59","2017年9月14日 下午5:02:46"],
            ["闽AD9913","包月(包时)","包月套餐有效期：2017-7-01 00:00:01-2017-12-31 23:59:59","2017年9月14日 下午2:11:46"],
            ["闽AD9913","包月(包时)","包月套餐有效期：2017-7-01 00:00:01-2017-12-31 23:59:59","2017年9月14日 下午4:12:46"],
            ["闽AS8196","包月(包时)","包月套餐有效期：2017-7-01 00:00:01-2017-12-31 23:59:59","2017年9月14日 下午1:02:16"],
            ["闽ADD399","包月(包时)","包月套餐有效期：2017-7-01 00:00:01-2017-12-31 23:59:59","2017年9月14日 下午2:02:26"],
            ["闽A00U13","包月(包时)","包月套餐有效期：2017-7-01 00:00:01-2017-12-31 23:59:59","2017年9月14日 下午3:02:56"],
            ["闽A835CB","包月(包时)","包月套餐有效期：2017-7-01 00:00:01-2017-12-31 23:59:59","2017年9月14日 下午6:02:06"],
            ["闽A835CB","包月(包时)","包月套餐有效期：2017-7-01 00:00:01-2017-12-31 23:59:59","2017年9月14日 早午9:02:46"]
        ],
        columnDefs: [
            {
                "render": function(data, type, row, meta) {
                    return '<span style="color: #767676">'+data+'</span>'
                },
                "targets": [0,1, 2,3],
            },
        ],
        language:dataTableLanguage
    } );
}











